Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.SetValueAsColor(Autodesk.Revit.DB.Color)
Sets the value property as a color.
color:
The new color.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value is invalid for this AssetPropertyDoubleArray4d property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.IsValidValue(Autodesk.Revit.DB.Color)
Checks that the value is a valid value for this property.
color:
The value to be checked.
Returns:
True if the value is valid for the property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.SetValueAsDoubles(System.Collections.Generic.IList{System.Double})
Sets the value of the property.
value:
The new value as doubles.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value is invalid for this AssetPropertyDoubleArray4d property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.IsValidValue(System.Collections.Generic.IList{System.Double})
Checks that the value is a valid value for this property.
value:
The value to be checked.
Returns:
True if the value is valid for the property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1